import Mock from 'mockjs';

Mock.mock("/hotdata", "get", {
    "banner": [
        {
            "imgUrl": "http://res.imtt.qq.com/audio/ocms/yinyuebanner.jpg"
        },
        {
            "imgUrl": "http://res.imtt.qq.com/res_mtt/audioBg/bg1.jpg"
        }
    ],
    "nav": [
        {
            "navtitle": "网络小说",
            "navicon": "data:image/svg+xml;charset=utf8,%3Csvg%20viewBox='0%200%2056%2056'%20xmlns='http://www.w3.org/2000/svg'%3E%3Cg%20fill='none'%20fill-rule='evenodd'%3E%3Crect%20fill='%23E87646'%20width='56'%20height='56'%20rx='28'/%3E%3Cpath%20d='M22%2015h16a3%203%200%200%201%203%203v20a3%203%200%200%201-3%203H22a1%201%200%200%201-1-1V16a1%201%200%200%201%201-1zm-5%200h1a1%201%200%200%201%201%201v24a1%201%200%200%201-1%201h-1a2%202%200%200%201-2-2V17a2%202%200%200%201%202-2zm11.514%207.909a1%201%200%200%200-1.514.857v8.468a1%201%200%200%200%201.514.857l7.057-4.234a1%201%200%200%200%200-1.714l-7.057-4.234z'%20fill='%23FFF'/%3E%3C/g%3E%3C/svg%3E"
        },
        {
            "navtitle": "情感",
            "navicon": "data:image/svg+xml;charset=utf8,%3Csvg%20viewBox='0%200%2056%2056'%20xmlns='http://www.w3.org/2000/svg'%3E%3Cg%20fill='none'%20fill-rule='evenodd'%3E%3Crect%20fill='%23E75757'%20width='56'%20height='56'%20rx='28'/%3E%3Cpath%20d='M27.932%2020.55c.617%200%202.858-4.55%207.43-4.55%204.573%200%208.59%204.55%207.44%2010.947C41.65%2033.345%2029.3%2042%2027.931%2042c-1.369%200-14.244-8.553-14.862-15.053C12.453%2020.447%2015.977%2016%2020.55%2016s6.766%204.55%207.383%204.55zm1.044%2014.296a1.048%201.048%200%200%200-.164%201.615c.553.553%201.418.64%202.07.208a28.505%2028.505%200%200%200%204.427-3.61%2028.504%2028.504%200%200%200%203.61-4.427%201.644%201.644%200%200%200-.208-2.07%201.048%201.048%200%200%200-1.615.164%2028.515%2028.515%200%200%201-3.644%204.476%2028.515%2028.515%200%200%201-4.476%203.644z'%20fill='%23FFF'/%3E%3C/g%3E%3C/svg%3E"
        },
        {
            "navtitle": "财经",
            "navicon": "data:image/svg+xml;charset=utf8,%3Csvg%20viewBox='0%200%2056%2056'%20xmlns='http://www.w3.org/2000/svg'%3E%3Cg%20fill='none'%20fill-rule='evenodd'%3E%3Crect%20fill='%234C9AFA'%20width='56'%20height='56'%20rx='28'/%3E%3Cpath%20d='M16%2015h24a1%201%200%200%201%201%201v24a1%201%200%200%201-1%201H16a1%201%200%200%201-1-1V16a1%201%200%200%201%201-1zm2.75%2019.62a1.5%201.5%200%200%200%202.598%201.5l5.75-9.96-2.598-1.5-5.75%209.96zm10.312-3.862l2.598%201.5%205.75-9.959a1.5%201.5%200%201%200-2.598-1.5l-5.75%209.96zm-3.464-2l3.464%202%201.5-2.598-3.464-2-1.5%202.598z'%20fill='%23FFF'/%3E%3C/g%3E%3C/svg%3E"
        },
        {
            "navtitle": "相声",
            "navicon": "data:image/svg+xml;charset=utf8,%3Csvg%20viewBox='0%200%2056%2056'%20xmlns='http://www.w3.org/2000/svg'%3E%3Cg%20fill='none'%20fill-rule='evenodd'%3E%3Crect%20fill='%23976754'%20width='56'%20height='56'%20rx='28'/%3E%3Cpath%20d='M11.05%2029.123C12.01%2020.613%2019.23%2014%2027.997%2014c8.766%200%2015.987%206.614%2016.946%2015.123L27.997%2037%2011.05%2029.123z'%20fill='%23FFF'/%3E%3Cpath%20d='M21.688%2039.912L28.003%2035l6.315%204.912A7.986%207.986%200%200%201%2028.003%2043a7.986%207.986%200%200%201-6.315-3.088z'%20fill='%23FFF'/%3E%3Cpath%20d='M18%2025.5c2.333-3.667%205.667-5.5%2010-5.5s7.667%201.833%2010%205.5'%20stroke='%23976754'%20stroke-width='2.5'%20stroke-linecap='square'/%3E%3C/g%3E%3C/svg%3E"
        },
        {
            "navtitle": "儿童",
            "navicon": "data:image/svg+xml;charset=utf8,%3Csvg%20viewBox='0%200%2056%2056'%20xmlns='http://www.w3.org/2000/svg'%3E%3Cg%20fill='none'%20fill-rule='evenodd'%3E%3Crect%20fill='%23EC6E8E'%20width='56'%20height='56'%20rx='28'/%3E%3Cpath%20d='M14.515%2024.224C16.163%2018.326%2021.576%2014%2028%2014c6.424%200%2011.837%204.326%2013.485%2010.224a5.002%205.002%200%200%201-.811%209.731C38.436%2038.709%2033.603%2042%2028%2042s-10.436-3.29-12.674-8.045a5.001%205.001%200%200%201-.81-9.73zm9.802-6.288C20.097%2020.765%2021.127%2030%2031.724%2030%2028%2023.372%2034%2025.336%2034%2021.339s-5.462-6.232-9.683-3.403z'%20fill='%23FFF'/%3E%3C/g%3E%3C/svg%3E"
        },
    ],
    "nav2":[
        {
            "navtitle":"资讯联播",
            "bg":"http://res.imtt.qq.com/audio/scene/news.png"
        },
        {
            "navtitle": "轻松一刻",
            "bg": "http://res.imtt.qq.com/audio/scene/easy.png"
        },
        {
            "navtitle": "情感电台",
            "bg": "http://res.imtt.qq.com/audio/scene/emotion.png"
        },
        {
            "navtitle": "哄娃入睡",
            "bg": "http://res.imtt.qq.com/audio/scene/baby.png"
        },
        {
            "navtitle": "放轻松音乐",
            "bg": "http://res.imtt.qq.com/audio/scene/music.png"
        },
        {
            "navtitle": "戏曲过把瘾",
            "bg": "http://res.imtt.qq.com/audio/scene/opera.png"
        }
    ],
    "list":[
        {
            "id":0,
            "title":"标题一"
        },
        {
            "id": 1,
            "title": "标题二"
        },
        {
            "id": 2,
            "title": "标题三"
        },
        {
            "id": 3,
            "title": "标题四"
        },
        {
            "id": 4,
            "title": "标题五"
        },
        {
            "id": 5,
            "title": "标题六"
        },
        {
            "id": 6,
            "title": "标题七"
        },
    ]
})